### Импорт библиотек

In [2]:
import pandas as pd

### Открываем таблицу очищенную от лишних данных с уникальным адресом недвижимости

In [4]:
df = pd.read_csv('all_data.csv')
df.head()

                              Uniq Adress   Price
0               SHAFTESBURY ROAD 25 LUTON  241500
1  SOUTHWOOD ROAD 49 CENTRAL BEDFORDSHIRE  180000
2                      SWAN MEAD 66 LUTON  159000
3                   DENNIS ROAD 3 BEDFORD  205000
4   WINDMILL ROAD 59 CENTRAL BEDFORDSHIRE  249000

### Суммируем продажи за все время по Полному Адресу

In [5]:
# df1 - это новый фрейм с проссумированной 
# ценой по полному адресу недвижимости

df1 = df.groupby('Uniq Adress').sum(['Price'])
df1.reset_index(inplace=True)
df1.head(4)

                                 Uniq Adress  Price
0   10TH AVENUE 2 CITY OF KINGSTON UPON HULL  22000
1  10TH AVENUE 37 CITY OF KINGSTON UPON HULL  35000
2   10TH AVENUE 4 CITY OF KINGSTON UPON HULL  39060
3                  11TH AVENUE 12 HUMBERSIDE  18950

### Объединяем таблицы по Уникальному Адресу, сохраняя цены двух таблиц

In [9]:
resault = df1.merge(df[['Uniq Adress', 'Price']], how='outer',
                    on='Uniq Adress')
resault.head(4)

                                 Uniq Adress  Price_x  Price_y
0   10TH AVENUE 2 CITY OF KINGSTON UPON HULL    22000    10000
1   10TH AVENUE 2 CITY OF KINGSTON UPON HULL    22000    12000
2  10TH AVENUE 37 CITY OF KINGSTON UPON HULL    35000    35000
3   10TH AVENUE 4 CITY OF KINGSTON UPON HULL    39060    39060

### Сравниваем цены

In [10]:
resault['compare'] = resault['Price_x'] != resault['Price_y']
resault.head(4)

                                 Uniq Adress  Price_x  Price_y  compare
0   10TH AVENUE 2 CITY OF KINGSTON UPON HULL    22000    10000     True
1   10TH AVENUE 2 CITY OF KINGSTON UPON HULL    22000    12000     True
2  10TH AVENUE 37 CITY OF KINGSTON UPON HULL    35000    35000    False
3   10TH AVENUE 4 CITY OF KINGSTON UPON HULL    39060    39060    False

### Оставляем только True значения (цены разные)

In [12]:
answer = resault.loc[resault['compare'] == True]
answer.head(4)

                                 Uniq Adress  Price_x  Price_y  compare
0   10TH AVENUE 2 CITY OF KINGSTON UPON HULL    22000    10000     True
1   10TH AVENUE 2 CITY OF KINGSTON UPON HULL    22000    12000     True
7  11TH AVENUE 38 CITY OF KINGSTON UPON HULL   284000    20500     True
8  11TH AVENUE 38 CITY OF KINGSTON UPON HULL   284000    59000     True

### Убираем дубликаты и Nan значения

In [ ]:
a = answer.dropna(how='any')
b = a.drop_duplicates(subset=['Uniq Adress'])

### Результат в виде таблицы

In [ ]:
b['Uniq Adress'].to_csv('final.csv')